app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
---
	def destroy
		@article = Article.find(params[:id]).destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2016-03-30 12:45:03.333488"], ["image_file_name", "index.jpeg"], ["updated_at", "2016-03-30 12:45:03.348676"], ["id", 19]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(article_params)