app/controllers/comments_controller.rb

	def create
		before_filter :require_login, except: [:create]
		@comment = Comment.new(comment_params)
		@comment.article_id = params[:article_id]
		@comment.save
---
INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "revathi"], ["body", "I love Deepak"], ["article_id", 9], ["created_at", "2016-03-30 07:29:55.614314"], ["updated_at", "2016-03-30 07:29:55.614314"]]